# Third-party taps. Trust is scoped to the fully qualified packages below.
tap "agrinman/tap"
tap "anomalyco/tap"
tap "fognil/tap"
tap "hashicorp/tap"
tap "jesseduffield/lazydocker"
tap "leoafarias/fvm"
tap "localsend/localsend"
tap "oven-sh/bun"
# Boring Notch uses a custom remote; only its stable cask is trusted below.
tap "theboredteam/boring-notch", "https://github.com/TheBoredTeam/homebrew-boring-notch"
tap "xykong/tap"
# Expose local web services through secure tunnels
brew "agrinman/tap/tunnelto", trusted: true
# AI coding agent for the terminal
brew "anomalyco/tap/opencode", trusted: true
# File organization and cleanup CLI
brew "fognil/tap/neatcli", trusted: true
# Infrastructure as code tool
brew "hashicorp/tap/terraform", trusted: true
# Terminal UI for Docker and Docker Compose
brew "jesseduffield/lazydocker/lazydocker", trusted: true
# Flutter version manager
brew "leoafarias/fvm/fvm", trusted: true
# JavaScript runtime, bundler, and test runner
brew "oven-sh/bun/bun", trusted: true
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# YAML Parser
brew "libyaml"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library for command-line editing
brew "readline"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Install and debug iPhone apps from the command-line
brew "ios-deploy"
# X.509 and CMS library
brew "libksba"
# Generic library support script
brew "libtool"
# LLM inference in C/C++
brew "llama.cpp"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Install various Ruby versions and implementations
brew "ruby-build"
# Display and control your Android device
brew "scrcpy"
# SMART hard drive monitoring
brew "smartmontools"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Feature-rich console based todo list manager
brew "task"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Stand alone ad blocker
cask "adguard"
# Application launcher and productivity software
cask "alfred"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Screen capturing and editing tool
cask "bettershot"
# Send any size file between devices
cask "blip"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch", trusted: true
# Web browser focusing on privacy
cask "brave-browser"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Utility that prevents the system from going to sleep
cask "caffeine"
# OpenAI's official browser with ChatGPT built in
cask "chatgpt-atlas"
# Anthropic's official Claude AI desktop app
cask "claude"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Universal database tool and SQL client
cask "dbeaver-community"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Voice and text chat software
cask "discord"
# Web browser focusing on privacy
cask "duckduckgo"
# Web browser
cask "firefox"
# Web browser
cask "firefox@developer-edition"
# Flip clock screensaver
cask "fliqlo"
# Beautiful Markdown previews in macOS Finder QuickLook
cask "xykong/tap/flux-markdown", trusted: true
# Quick Look extension for folders
cask "folder-preview-pro"
cask "font-monaspace"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar calendar
cask "itsycal"
# JetBrains tools manager
cask "jetbrains-toolbox"
# An open source cross-platform alternative to AirDrop
cask "localsend/localsend/localsend", trusted: true
# Clipboard manager
cask "maccy"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
# Client for Proton Drive
cask "proton-drive"
# Client for Proton Mail and Proton Calendar
cask "proton-mail"
# Desktop client for Proton Pass
cask "proton-pass"
# VPN client focusing on security
cask "protonvpn"
# GUI for streamlined Redis application development
cask "redis-insight"
# Emoji picker optimised for blind people
cask "rocket"
# Screenshot measurement and annotation tool
cask "shottr"
# PDF reader and note-taking application
cask "skim"
# System monitor for the menu bar
cask "stats"
# Open-source media center
cask "stremio"
# Companion app for Stremio Web
cask "stremioservice"
# Text editor for code, markup and prose
cask "sublime-text"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# SSH client
cask "termius"
# Unpacks archive files
cask "the-unarchiver"
# Customizable timing of breaks
cask "time-out"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# Batch rename utility
cask "transnomino"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
# Comic reader
cask "yacreader"
# Video communication and virtual meeting platform
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "ahmadawais.shades-of-purple"
vscode "alefragnani.project-manager"
vscode "blaxou.freezed"
vscode "britesnow.vscode-toggle-quotes"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "felixangelov.bloc"
vscode "flutterando.flutter-mobx"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.vscode-pull-request-github"
vscode "gmlewis-vscode.flutter-stylizer"
vscode "grapecity.gc-excelviewer"
vscode "gruntfuggly.todo-tree"
vscode "jeroen-meijer.pubspec-assist"
vscode "johnpapa.vscode-peacock"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mattpocock.ts-error-translator"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "orta.vscode-twoslash-queries"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "plibither8.remove-comments"
vscode "pomber.git-file-history"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "wesbos.theme-cobalt2"
vscode "yoavbls.pretty-ts-errors"
vscode "zignd.html-css-class-completion"
npm "corepack"
npm "fieldtheory"
