# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Formulae
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git' # Installed with xcode
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'neofetch' # Installs Lots of Formulae
brew 'pkg-config'
brew 'tree' # List directories in a tree structure
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Development
brew 'node'
brew 'yarn'

# Apps
cask 'alfred'
cask 'bitwarden'
cask 'caffeine'
cask 'coconutbattery'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'microsoft-teams' # For College Purposes
cask 'postman'
cask 'rectangle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-meslo-for-powerline' # VSCode
cask 'font-source-code-pro-for-powerline'