# specify a directory to install
# set arguments for all 'brew cask install' commands
cask_args appdir: "~/Applications"

# ======= Taps ======= #
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# ======= Formulae ======= #
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa' # Modern 'ls' command
brew 'git'
brew 'grep' # same comment as 'coreutils'
brew 'httpie' # Command Line Alternative for Postman
brew 'mackup'
brew 'neofetch'
brew 'tree' # List directories in a tree structure

# ======= Java ======== #
tap 'adoptopenjdk/openjdk'
cask 'adoptopenjdk' # Latest java
cask 'corretto8'
cask 'corretto11'
cask 'jenv'

# ======= Python ======= #
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'pyenv'

# ======= Apps ======= #
cask 'alfred'
cask 'bitwarden'
cask 'caffeine'
cask 'coconutbattery'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'rectangle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'virtualbox' # Requires permission
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wpsoffice'

# ======= Fonts ======= #
cask 'font-meslo-for-powerline' # VSCode
cask 'font-meslo-lg-nerd-font' # Recommended font for powerlevel10k theme
cask 'font-source-code-pro-for-powerline'

# ======= Theme ======= #
brew 'romkatv/powerlevel10k/powerlevel10k'