# Taps
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Formulae
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'grep'
brew 'httpie' # Command Line Alternative for Postman
brew 'mackup'
brew 'neofetch'
brew 'pkg-config'
brew 'tree' # List directories in a tree structure

# Development
brew 'node'
brew 'yarn'

# Java
tap 'adoptopenjdk/openjdk' # Download Various Java Versions
cask 'java' # Latest Stable Version
cask 'adoptopenjdk' # Latest adoptopenjdk Version
cask 'adoptopenjdk8' # Java 8 LTS Version
cask 'adoptopenjdk11' # Java 11 LTS Version
cask 'corretto' # Latest Amazon Corretto Version (i.e) 11 
cask 'corretto8' # Amazon Corretto 8 Version 
cask 'jenv' # Manage Java Environment

# Python
brew 'openssl' # Recommended for Pyenv
brew 'readline' # Recommended for Pyenv
brew 'sqlite3' # Recommended for Pyenv
brew 'xz' # Recommended for Pyenv
brew 'zlib' # Recommended for Pyenv
brew 'pyenv'

# Apps
cask 'alfred'
cask 'bitwarden'
cask 'caffeine'
cask 'coconutbattery'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox-developer-edition'
cask 'flux'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'rectangle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission' #Failing
cask 'virtualbox' # Requires permission
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wpsoffice'

# Fonts
cask 'font-meslo-for-powerline' # VSCode
cask 'font-source-code-pro-for-powerline'