# specify a directory to install
# set arguments for all 'brew cask install' commands
cask_args appdir: "~/Applications"

# ======= Taps ======= #
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# ======= Formulae ======= #
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'exa' # Modern 'ls' command
brew 'fnm' # Fast Node Manager
brew 'git'
brew 'grep' # same comment as 'coreutils'
brew 'httpie' # Command Line Alternative for Postman
brew 'mackup'
brew 'neofetch'
brew 'neovim'
brew 'pnpm' # Node Package Manager (https://pnpm.io/)
brew 'tmux' # Teminal Multiplexer. (Need to set up this)
brew 'tree' # List directories in a tree structure
brew 'vim'
brew 'watchman'

# ======= Java ======== #
cask 'corretto8'
cask 'corretto11'
cask 'temurin' # latest java
cask 'temurin11'
cask 'jenv'

# ======= Python ======= #
brew 'openssl'
brew 'readline'
brew 'sqlite3'
brew 'xz'
brew 'zlib'
brew 'pyenv'
brew 'pyenv-virtualenv'
# brew 'poetry'

# ======= Flutter ======= #
# REF: Try official installation docs: https://flutter.dev/docs/get-started/install/macos
# REF: Flutter Version Management (https://fvm.app/)
# tap 'leoafarias/fvm' 
# brew 'fvm'

# ======= GO ======= #
brew 'golang'

# ======= Apps ======= #
cask 'alfred'
cask 'android-file-transfer'
cask 'beekeeper-studio'
cask 'bitwarden'
cask 'caffeine'
cask 'coconutbattery'
cask 'dbeaver-community'
cask 'dbngin'
cask 'discord'
cask 'docker'
# cask 'dropbox' # TODO: uncomment after proper setup
cask 'firefox'
cask 'firefox-developer-edition'
cask 'flux'
# cask 'google-backup-and-sync' # TODO: uncomment after proper setup
cask 'google-chrome'
cask 'iina' # video player
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'postman'
cask 'rectangle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
# cask 'virtualbox' # Requires permission
# cask 'virtualbox-extension-pack' # TODO: uncomment after proper setup
cask 'visual-studio-code'
cask 'vlc' # video player
cask 'whatsapp'
cask 'wpsoffice'

# ======= Fonts ======= #
cask 'font-meslo-for-powerline' # VSCode
cask 'font-meslo-lg-nerd-font' # Recommended font for powerlevel10k theme
cask 'font-source-code-pro-for-powerline'
cask 'font-fira-code'

# ======= Theme ======= #
brew 'romkatv/powerlevel10k/powerlevel10k'